Show / Hide Table of Contents
Class ISDModel
Model of IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
ISDModel
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ISDModel : OpenElementId
Constructors
Improve this Doc   View Source
ISDModel()
Constructor
Declaration
public ISDModel()
Properties
Improve this Doc   View Source
Geometry
All geometrical entities of Detail
Declaration
public List<ReferenceElement> Geometry { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
ISDType
Type of IDEA StatiCa Detail
Declaration
public ISDType ISDType { get; set; }
Property Value
 Type |  Description
 ISDType
Improve this Doc   View Source
Loading
All loading entities of Detail
Declaration
public List<ReferenceElement> Loading { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
Reinforcement
All reinforcement of Detail
Declaration
public List<ReferenceElement> Reinforcement { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
Setting
Setting
Declaration
public ISDSetting Setting { get; set; }
Property Value
 Type |  Description
 ISDSetting
 Improve this Doc
 View Source